---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilteredWorksetCollector
source: html/1901f186-872e-cae5-dea3-8edf043f7cb2.htm
---
# FilteredWorksetCollector Methods

Returns the first workset to pass the filter(s).